#include "SceneBase.h"
#include "..\..\System\\GameBase.h"

//複数のシーンで共用するデータ構造体
Common::CommonData SceneBase::m_gameData;

//=============================================================================
// コンストラクタ
// 引　数：Engine* エンジンクラスのアドレス
//=============================================================================
SceneBase::SceneBase()
{
}

//=============================================================================
// 仮想デストラクタ
//=============================================================================
SceneBase::~SceneBase()
{
}
